MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_timer.h"
#include "esp_log.h"

#include "esp_lcd_panel_ops.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_st7121.h"
#include "esp_ldo_regulator.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "driver/ppa.h"
#include "bsp/esp-bsp.h"
#include "bsp/m5stack_tab5.h"
#include "lvgl.h"

#include "display_tab5.h"
#include "pins.h"
#include "tab5_revision.h"

static const char *TAG = "TAB5-DISPLAY";

#define TAB5_BRIDGE_CHUNK_ROWS 12
#define TAB5_SHARED_RENDER_W 1280
#define TAB5_SHARED_RENDER_H 720
/* L1 and L2 lines are both 64B on this target (CONFIG_CACHE_*_CACHE_LINE_64B). */
#define TAB5_CACHE_LINE_BYTES 64
#define TAB5_REPL_TRANSPARENT_BG 0x55
/* Set to 1 for bring-up testing to force rotated provider path using scaffold data. */
#define TAB5_FORCE_ROTATED_PROVIDER_TEST 0

static uint32_t s_bridge_frame_id = 0;
static bool s_tulip_shared_renderer_initialized = false;

/* Shared-provider symbols are provided by TAB5 bring-up provider today and
 * will later be replaced by the full Tulip shared renderer implementation. */
extern bool display_bounce_empty(void *bounce_buf, int pos_px, int len_bytes, void *user_ctx);
extern bool display_frame_done_generic(void);
extern uint8_t brightness;
extern void display_init(void);
extern void display_set_bg_pixel_pal(uint16_t x, uint16_t y, uint8_t pal_idx);
extern void display_tfb_set_default_bg_color(uint8_t color);
extern int16_t lvgl_is_repl;
/* Shared Tulip stats, read back by tulip.fps() / tulip.gpu(). */
extern float reported_fps;
extern float reported_gpu_usage;
extern uint8_t gpu_log;
/* Set by anything that changes the framebuffer contents; see shared/display.c. */
extern volatile uint8_t display_dirty;
extern bool display_take_dirty_rows(int *y0, int *y1);
extern void display_mark_dirty_rows(int y0, int y1);

bool tab5_repl_menu_icon_touch_event(int16_t shared_x, int16_t shared_y, bool up)
{
    (void)shared_x;
    (void)shared_y;
    (void)up;
    return false;
}

static void tab5_clear_boot_background(void)
{
    // Fill with a stable solid tone to avoid test-pattern artifacts.
    for (uint16_t y = 0; y < BSP_LCD_V_RES; y++) {
        for (uint16_t x = 0; x < BSP_LCD_H_RES; x++) {
            (void)x;
            display_set_bg_pixel_pal(x, y, 9);
        }
    }
}

static bool tab5_scaffold_bounce_empty(void *bounce_buf, int pos_px, int len_bytes, void *user_ctx)
{
    (void)user_ctx;

    if (bounce_buf == NULL || len_bytes <= 0) {
        return false;
    }

    uint8_t *out = (uint8_t *)bounce_buf;
    const int row0 = pos_px / BSP_LCD_H_RES;
    const int rows = len_bytes / BSP_LCD_H_RES;

    for (int r = 0; r < rows; r++) {
        const int y = row0 + r;
        for (int x = 0; x < BSP_LCD_H_RES; x++) {
            const uint8_t bar = (uint8_t)((x * 8) / BSP_LCD_H_RES);
            const uint8_t anim = (uint8_t)((y + (int)(s_bridge_frame_id & 0x1f)) & 0x1f);
            out[r * BSP_LCD_H_RES + x] = (uint8_t)((bar << 5) | anim);
        }
    }

    return true;
}

static bool tab5_scaffold_frame_done(void)
{
    s_bridge_frame_id++;
    return true;
}

static void tab5_render_bridge_buffers_deinit(void);

static tab5_render_bounce_empty_fn_t s_render_bounce_empty = tab5_scaffold_bounce_empty;
static tab5_render_frame_done_fn_t s_render_frame_done = tab5_scaffold_frame_done;
static uint8_t *s_line332 = NULL;
static uint16_t *s_line565 = NULL;
/* Landscape RGB565 staging image, exactly what Tulip renders (1280x720).
 * The panel is physically portrait, so this gets rotated on the way out. */
static uint16_t *s_stage565 = NULL;
static int s_linebuf_width = 0;

/* rgb332 -> rgb565 lookup, built once. The arithmetic version costs three
 * integer divides per pixel, which at 921600 pixels a frame is not affordable. */
static uint16_t s_rgb332_565[256];
static bool s_rgb332_565_ready = false;

/* Hardware rotation. The ESP32-P4 PPA does scale/rotate/mirror in a DMA engine,
 * so the CPU never touches the portrait framebuffer. */
static ppa_client_handle_t s_ppa_srm = NULL;
static void *s_dsi_fb[2] = {NULL, NULL};
static uint8_t s_dsi_fb_count = 0;
static uint8_t s_dsi_fb_next = 0;
static uint32_t s_ppa_failures = 0;

/* Per-frame phase timings, in microseconds, for the last completed frame.
 * Surfaced through tulip.tab5_render_stats() so the cost of a change can be
 * attributed instead of guessed at. */
static uint32_t s_us_composite = 0;   /* Tulip compositor callbacks */
static uint32_t s_us_convert = 0;     /* rgb332 -> rgb565 into the staging image */
static uint32_t s_us_rotate = 0;      /* PPA (or CPU fallback) rotation */
static uint32_t s_us_present = 0;     /* draw_bitmap: cache write-back + fb swap */
static uint32_t s_us_wait = 0;        /* blocked waiting for the panel */
static uint32_t s_frames_skipped = 0; /* frames dropped because nothing changed */
static uint32_t s_band_rows = 0;      /* rows recomposed for the last frame */

/* Damage presented into the other DSI framebuffer last frame. */
static int s_prev_band_y0 = 0;
static int s_prev_band_y1 = TAB5_SHARED_RENDER_H;

/* Panel refresh signal, so the loop paces to the display instead of a fixed
 * vTaskDelay stacked on top of however long the frame happened to take. */
static SemaphoreHandle_t s_vsync_sem = NULL;
/* Redraw the panel even when nothing reported a change, so a missed
 * display_mark_dirty() shows up as a stale second rather than a frozen screen --
 * but a slice of it at a time. The display task is serial and a whole 720-row
 * frame costs ~130ms of composite + convert + rotate, so redrawing all of it in
 * one go parked every damage band behind a 130ms stall roughly once a second:
 * drums.py's beat LEDs stopped following the sequencer for a third of a step,
 * several times a bar. A slice is ~17ms, and eight of them one every four frames
 * cover the screen in the same ~0.9s for the same rows per second. */
#define TAB5_FORCED_SLICE_FRAMES 4
#define TAB5_FORCED_SLICES 8
#define TAB5_FORCED_SLICE_ROWS ((TAB5_SHARED_RENDER_H + TAB5_FORCED_SLICES - 1) / TAB5_FORCED_SLICES)
/* A slice waits for a frame that has no damage of its own (see below). If every
 * frame has some, it cannot wait for ever. */
#define TAB5_FORCED_SLICE_MAX_FRAMES (TAB5_FORCED_SLICE_FRAMES * 8)
static int s_provider_width = BSP_LCD_H_RES;
static int s_provider_height = BSP_LCD_V_RES;
static bool s_shared_provider_active = false;
static uint32_t s_bridge_frames = 0;
static volatile uint32_t s_display_task_entries = 0;
static uint32_t s_bridge_fallbacks = 0;
static uint32_t s_native_callback_failures = 0;
static uint32_t s_rotated_callback_failures = 0;
static int64_t s_last_stats_log_us = 0;
static uint32_t s_last_stats_frames = 0;
static int64_t s_window_busy_us = 0;

