MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
/* Refresh the numbers behind tulip.fps() / tulip.gpu().
 *
 * The esp32s3 port averages over a fixed 100 frames, which is unusable here:
 * at the rates this bridge runs that would be a 25-second window. Average over
 * a 1-second wall-clock window instead, and report GPU usage as the fraction of
 * that window actually spent inside the render tick. */
#define TAB5_STATS_WINDOW_US 1000000

static void tab5_bridge_update_stats(void)
{
    const int64_t now_us = esp_timer_get_time();
    if (s_last_stats_log_us == 0) {
        s_last_stats_log_us = now_us;
        s_last_stats_frames = s_bridge_frames;
        s_window_busy_us = 0;
        return;
    }

    const int64_t elapsed_us = now_us - s_last_stats_log_us;
    if (elapsed_us < TAB5_STATS_WINDOW_US) {
        return;
    }

    const uint32_t window_frames = s_bridge_frames - s_last_stats_frames;
    const float window_fps = (float)window_frames * 1000000.0f / (float)elapsed_us;

    reported_fps = window_fps;
    reported_gpu_usage = (float)s_window_busy_us * 100.0f / (float)elapsed_us;
    if (reported_gpu_usage > 100.0f) {
        reported_gpu_usage = 100.0f;
    }

    s_last_stats_log_us = now_us;
    s_last_stats_frames = s_bridge_frames;
    s_window_busy_us = 0;

    /* Same one-shot semantics as the esp32s3 port: tulip.gpu_reset() arms it. */
    if (!gpu_log) {
        return;
    }
    gpu_log = 0;
    ESP_LOGI(TAG,
             "bridge stats: frames=%lu window_fps=%.2f fallbacks=%lu native_fail=%lu rotated_fail=%lu provider=%s (%dx%d)",
             (unsigned long)s_bridge_frames,
             window_fps,
             (unsigned long)s_bridge_fallbacks,
             (unsigned long)s_native_callback_failures,
             (unsigned long)s_rotated_callback_failures,
             s_shared_provider_active ? "shared" : "scaffold",
             s_provider_width,
             s_provider_height);
}

static void tab5_use_scaffold_provider(const char *reason)
{
    tab5_set_render_provider_with_geometry(tab5_scaffold_bounce_empty,
                                           tab5_scaffold_frame_done,
                                           BSP_LCD_H_RES,
                                           BSP_LCD_V_RES);
    s_shared_provider_active = false;
    s_bridge_fallbacks++;
    if (reason != NULL) {
        ESP_LOGW(TAG, "Falling back to scaffold render provider: %s", reason);
    }
}

void tab5_set_render_provider(tab5_render_bounce_empty_fn_t bounce_empty_cb,
                              tab5_render_frame_done_fn_t frame_done_cb)
{
    tab5_set_render_provider_with_geometry(bounce_empty_cb, frame_done_cb, BSP_LCD_H_RES, BSP_LCD_V_RES);
}

void tab5_set_render_provider_with_geometry(tab5_render_bounce_empty_fn_t bounce_empty_cb,
                                            tab5_render_frame_done_fn_t frame_done_cb,
                                            int provider_width,
                                            int provider_height)
{
    if (bounce_empty_cb != NULL) {
        s_render_bounce_empty = bounce_empty_cb;
    }
    if (frame_done_cb != NULL) {
        s_render_frame_done = frame_done_cb;
    }

    if (provider_width > 0) {
        s_provider_width = provider_width;
    }
    if (provider_height > 0) {
        s_provider_height = provider_height;
    }
}

static void tab5_build_color_lut(void)
{
    if (s_rgb332_565_ready) {
        return;
    }
    for (int i = 0; i < 256; i++) {
        const uint8_t r3 = (uint8_t)((i >> 5) & 0x07);
        const uint8_t g3 = (uint8_t)((i >> 2) & 0x07);
        const uint8_t b2 = (uint8_t)(i & 0x03);
        const uint16_t r5 = (uint16_t)((r3 * 31) / 7);
        const uint16_t g6 = (uint16_t)((g3 * 63) / 7);
        const uint16_t b5 = (uint16_t)((b2 * 31) / 3);
        s_rgb332_565[i] = (uint16_t)((r5 << 11) | (g6 << 5) | b5);
    }
    s_rgb332_565_ready = true;
}

static bool tab5_render_bridge_buffers_init(void)
{
    const bool needs_stage_frame = (s_provider_width != BSP_LCD_H_RES || s_provider_height != BSP_LCD_V_RES);
    const size_t row_bytes = (size_t)s_provider_width;
    const size_t chunk_bytes = (size_t)s_provider_width * TAB5_BRIDGE_CHUNK_ROWS;
    const size_t px_count = row_bytes > chunk_bytes ? row_bytes : chunk_bytes;

    tab5_build_color_lut();

    if (s_line332 != NULL && s_line565 != NULL) {
        const bool linebuf_matches = (s_linebuf_width == s_provider_width);
        const bool framebuf_matches = (!needs_stage_frame || s_stage565 != NULL);
        if (linebuf_matches && framebuf_matches) {
            if (!needs_stage_frame) {
                heap_caps_free(s_stage565);
                s_stage565 = NULL;
            }
            return true;
        }

        tab5_render_bridge_buffers_deinit();
    }

    /* Scratch line buffers are touched per pixel by the CPU; keep them in
     * internal SRAM so the compositor is not paying PSRAM latency per row. */
    s_line332 = heap_caps_malloc(px_count, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (s_line332 == NULL) {
        s_line332 = heap_caps_malloc(px_count, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    s_line565 = heap_caps_malloc(px_count * sizeof(uint16_t), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (s_line565 == NULL) {
        s_line565 = heap_caps_malloc(px_count * sizeof(uint16_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (s_line332 == NULL || s_line565 == NULL) {
        heap_caps_free(s_line332);
        heap_caps_free(s_line565);
        s_line332 = NULL;
        s_line565 = NULL;
        s_linebuf_width = 0;
        ESP_LOGE(TAG, "No memory for render bridge buffers");
        return false;
    }
    s_linebuf_width = s_provider_width;

    if (needs_stage_frame) {
        const size_t stage_px = (size_t)s_provider_width * s_provider_height;
        /* Cache-line aligned so the PPA input window sync stays cheap. */
        s_stage565 = heap_caps_aligned_alloc(TAB5_CACHE_LINE_BYTES,
                                             stage_px * sizeof(uint16_t),
                                             MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        if (s_stage565 == NULL) {
            ESP_LOGE(TAG, "No memory for %dx%d staging frame buffer",
                     s_provider_width, s_provider_height);
            tab5_render_bridge_buffers_deinit();
            return false;
        }
    } else {
        heap_caps_free(s_stage565);
        s_stage565 = NULL;
    }

