MinoruInachi/tulipcc/tulip/esp32p4/boards/TAB5/display_tab5.c
    return true;
}

static void tab5_render_bridge_buffers_deinit(void)
{
    heap_caps_free(s_line332);
    heap_caps_free(s_line565);
    heap_caps_free(s_stage565);
    s_line332 = NULL;
    s_line565 = NULL;
    s_stage565 = NULL;
    s_linebuf_width = 0;
}

static bool tab5_display_started = false;
/* Kept because the board tasks' log output does not reliably survive the
 * USB-Serial-JTAG console once MicroPython owns it -- a black screen with a
 * happily refreshing DSI is otherwise mute about which step failed. */
static esp_err_t s_display_new_err = ESP_ERR_INVALID_STATE;
static esp_err_t s_disp_on_err = ESP_ERR_INVALID_STATE;
/* Panel refreshes, counted so the live refresh rate can be measured from the
 * REPL -- which is the only way from here to tell which DPI timing the BSP
 * actually installed (the two board revisions differ by about 10Hz). */
static volatile uint32_t s_vsync_count = 0;
/* Set when the ST7121 panel was brought up here rather than by the BSP, so
 * the teardown path knows whose handles these are. */
static bool s_display_owned_locally = false;
static esp_ldo_channel_handle_t s_dsi_phy_pwr_chan = NULL;
static bsp_lcd_handles_t tab5_lcd_handles;

/* Convert one compositor row (rgb332) into the staging image (rgb565).
 * Straight-line, contiguous destination writes: one cache line fill per 32 px
 * instead of the one-per-pixel that the old in-place rotation forced. */
static inline void tab5_row332_to_stage565(const uint8_t *src, uint16_t *dst, int width)
{
    const uint16_t *lut = s_rgb332_565;
    int x = 0;
    for (; x + 4 <= width; x += 4) {
        dst[x + 0] = lut[src[x + 0]];
        dst[x + 1] = lut[src[x + 1]];
        dst[x + 2] = lut[src[x + 2]];
        dst[x + 3] = lut[src[x + 3]];
    }
    for (; x < width; x++) {
        dst[x] = lut[src[x]];
    }
}

/* Rotate the landscape staging image onto a portrait panel framebuffer.
 *
 * Tulip's (x, y) maps to panel (y, W-1-x), which is a 90 degree counter-
 * clockwise rotation -- exactly PPA_SRM_ROTATION_ANGLE_90. Returns false if
 * the PPA is unavailable or the transaction failed, so the caller can fall
 * back to the CPU path.
 *
 * `y_start`/`rows` select a horizontal band of the staging image. After a
 * 90 CCW rotation that band lands as a vertical column of the panel, at
 * panel x == y_start, so the destination block offset is on x, not y. */
static bool tab5_ppa_rotate_to_fb(void *dst_fb, int y_start, int rows)
{
    if (s_ppa_srm == NULL || dst_fb == NULL) {
        return false;
    }

    const ppa_srm_oper_config_t srm = {
        .in = {
            .buffer = s_stage565,
            .pic_w = (uint32_t)s_provider_width,
            .pic_h = (uint32_t)s_provider_height,
            .block_w = (uint32_t)s_provider_width,
            .block_h = (uint32_t)rows,
            .block_offset_x = 0,
            .block_offset_y = (uint32_t)y_start,
            .srm_cm = PPA_SRM_COLOR_MODE_RGB565,
        },
        .out = {
            .buffer = dst_fb,
            .buffer_size = (uint32_t)BSP_LCD_H_RES * BSP_LCD_V_RES * sizeof(uint16_t),
            .pic_w = BSP_LCD_H_RES,
            .pic_h = BSP_LCD_V_RES,
            .block_offset_x = (uint32_t)y_start,
            .block_offset_y = 0,
            .srm_cm = PPA_SRM_COLOR_MODE_RGB565,
        },
        .rotation_angle = PPA_SRM_ROTATION_ANGLE_90,
        .scale_x = 1.0f,
        .scale_y = 1.0f,
        .mode = PPA_TRANS_MODE_BLOCKING,
    };

    const esp_err_t err = ppa_do_scale_rotate_mirror(s_ppa_srm, &srm);
    if (err != ESP_OK) {
        s_ppa_failures++;
        if (s_ppa_failures == 1) {
            ESP_LOGE(TAG, "PPA rotate failed (%s); falling back to CPU rotation",
                     esp_err_to_name(err));
        }
        return false;
    }
    return true;
}

/* CPU fallback for the rotation, kept only for the case where the PPA cannot
 * be registered. This is the slow path the PPA exists to replace. */
static void tab5_cpu_rotate_to_fb(uint16_t *dst_fb)
{
    for (int y = 0; y < s_provider_height; y++) {
        const uint16_t *src = s_stage565 + (size_t)y * s_provider_width;
        uint16_t *col = dst_fb + y;
        for (int x = 0; x < s_provider_width; x++) {
            col[(size_t)((s_provider_width - 1) - x) * BSP_LCD_H_RES] = src[x];
        }
    }
}

static void tab5_render_bridge_tick_native(void)
{
    if (!tab5_render_bridge_buffers_init()) {
        return;
    }

    for (int y = 0; y < BSP_LCD_V_RES; y += TAB5_BRIDGE_CHUNK_ROWS) {
        const int rows = (y + TAB5_BRIDGE_CHUNK_ROWS <= BSP_LCD_V_RES) ? TAB5_BRIDGE_CHUNK_ROWS : (BSP_LCD_V_RES - y);
        const int pixels = BSP_LCD_H_RES * rows;
        if (!s_render_bounce_empty(s_line332, y * BSP_LCD_H_RES, pixels, NULL)) {
            ESP_LOGW(TAG, "render bounce callback returned false at y=%d", y);
            s_native_callback_failures++;
            if (s_shared_provider_active) {
                tab5_use_scaffold_provider("native callback returned false");
            }
            break;
        }

        tab5_row332_to_stage565(s_line332, s_line565, pixels);
        esp_lcd_panel_draw_bitmap(tab5_lcd_handles.panel, 0, y, BSP_LCD_H_RES, y + rows, s_line565);
    }

    (void)s_render_frame_done();
    s_bridge_frames++;
}

static void tab5_render_bridge_tick_rotated(int band_y0, int band_y1)
{
    if (!tab5_render_bridge_buffers_init()) {
        return;
    }

    if (s_stage565 == NULL) {
        ESP_LOGE(TAG, "Rotated path requires a staging frame buffer");
        return;
    }

    if (s_provider_width != TAB5_SHARED_RENDER_W || s_provider_height != TAB5_SHARED_RENDER_H) {
        ESP_LOGW(TAG, "Unsupported provider geometry %dx%d", s_provider_width, s_provider_height);
        if (s_shared_provider_active) {
            tab5_use_scaffold_provider("unsupported shared provider geometry");
        }
        return;
    }

    /* With two DSI framebuffers we compose into the one that is not on screen
     * and hand it over with a pointer swap; with one we have no choice but to
     * write the live buffer. */
    void *target_fb = (s_dsi_fb_count > 1) ? s_dsi_fb[s_dsi_fb_next] : s_dsi_fb[0];

    if (band_y0 < 0) band_y0 = 0;
    if (band_y1 > s_provider_height) band_y1 = s_provider_height;
    if (band_y1 <= band_y0) {
        return;
    }

    /* The framebuffer that is not on screen is a frame behind, so it also needs
     * the rows the previous frame changed, or a partial update resurrects stale
     * pixels every time the two alternate. Only the rotate has to be repeated:
     * the stage buffer is a persistent full-screen image, and nothing has
     * touched those rows in it since they were composed. Keeping the two runs
     * apart rather than unioning them is the point -- a safety slice at the top
     * of the screen and a beat LED at the bottom used to redraw everything in
     * between, 130ms of work for 130 rows of it. */
    int prev_y0 = 0;
    int prev_y1 = 0;
    if (s_dsi_fb_count > 1) {
        prev_y0 = s_prev_band_y0;
        prev_y1 = s_prev_band_y1;
        s_prev_band_y0 = band_y0;
        s_prev_band_y1 = band_y1;
        if (prev_y0 < 0) prev_y0 = 0;
        if (prev_y1 > s_provider_height) prev_y1 = s_provider_height;
        /* Touching or overlapping runs cost less as one rotate than two. */
        if (prev_y1 > prev_y0 && prev_y0 <= band_y1 && prev_y1 >= band_y0) {
            if (prev_y0 < band_y0) band_y0 = prev_y0;
            if (prev_y1 > band_y1) band_y1 = prev_y1;
            prev_y0 = prev_y1 = 0;
        }
    }
    s_band_rows = (uint32_t)(band_y1 - band_y0);

    uint32_t composite_us = 0;
    uint32_t convert_us = 0;
    int64_t t0 = esp_timer_get_time();

    /* Work a band of rows at a time. Composing in chunks amortises the
     * per-call overhead of the Tulip compositor, and converting into an
     * internal-RAM band before a single bulk copy keeps the scalar LUT loop
     * off PSRAM -- a per-pixel store straight to PSRAM stalls on the cache
     * line fetch and was the single most expensive phase of the frame. */
    for (int y = band_y0; y < band_y1; y += TAB5_BRIDGE_CHUNK_ROWS) {
        const int rows = (y + TAB5_BRIDGE_CHUNK_ROWS <= band_y1)
                             ? TAB5_BRIDGE_CHUNK_ROWS
                             : (band_y1 - y);
        const int pixels = s_provider_width * rows;

        if (!s_render_bounce_empty(s_line332, y * s_provider_width, pixels, NULL)) {
            ESP_LOGW(TAG, "render bounce callback returned false at src y=%d", y);
            s_rotated_callback_failures++;
            if (s_shared_provider_active) {
                tab5_use_scaffold_provider("rotated callback returned false");
            }
            break;
        }
        const int64_t t1 = esp_timer_get_time();

        tab5_row332_to_stage565(s_line332, s_line565, pixels);
        memcpy(s_stage565 + (size_t)y * s_provider_width, s_line565,
               (size_t)pixels * sizeof(uint16_t));
        const int64_t t2 = esp_timer_get_time();

        composite_us += (uint32_t)(t1 - t0);
        convert_us += (uint32_t)(t2 - t1);
        t0 = t2;
    }
    s_us_composite = composite_us;
    s_us_convert = convert_us;

    if (target_fb != NULL) {
        const int64_t t_rot = esp_timer_get_time();
        if (!tab5_ppa_rotate_to_fb(target_fb, band_y0, band_y1 - band_y0)) {
            tab5_cpu_rotate_to_fb((uint16_t *)target_fb);
        } else if (prev_y1 > prev_y0 &&
                   !tab5_ppa_rotate_to_fb(target_fb, prev_y0, prev_y1 - prev_y0)) {
            tab5_cpu_rotate_to_fb((uint16_t *)target_fb);
        }
        const int64_t t_pres = esp_timer_get_time();
        /* The buffer already lives inside the panel's framebuffer set, so this
         * is a cache write-back plus a framebuffer index switch -- no copy. */
        esp_lcd_panel_draw_bitmap(tab5_lcd_handles.panel, 0, 0, BSP_LCD_H_RES, BSP_LCD_V_RES, target_fb);
        s_us_rotate = (uint32_t)(t_pres - t_rot);
        s_us_present = (uint32_t)(esp_timer_get_time() - t_pres);
        if (s_dsi_fb_count > 1) {
            s_dsi_fb_next ^= 1u;
        }
    }

    (void)s_render_frame_done();
    s_bridge_frames++;
}

